IdeaRS.Connections
CutBeamByBeamData.KeptPartCode Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the code of the part which should be kept in the model after cutting. 0 - end 1 - begin
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int KeptPartCode { get; set; }
Property Value
Type: Int32
See Also
Reference
CutBeamByBeamData Class
IdeaRS.Connections.Data Namespace